### DataFrame

In [1]:
# DataFrame menggunakan list

import pandas as pd
data = [1,2,3,4]
df = pd.DataFrame(data)
df

   0
0  1
1  2
2  3
3  4

In [2]:
# DataFrame menggunakan dictionary

dictionary = {'buah':['Apel','Jeruk','Lemon'],'jumlah':[10,5,12]}
df = pd.DataFrame(dictionary)
df

    buah  jumlah
0   Apel      10
1  Jeruk       5
2  Lemon      12

### DataFrame List Tipe Data Campuran

In [3]:
# DataFrame menggunakan list dengan tipe data campuran
import pandas as pd
data = [['Berti',90,85,95,90.5],
       ['Qorygore',80,85,90,86.6],
       ['Bimo',70,75,80,78.5]]
index = [0,1,2]
kolom = ['Nama','Tugas','UTS','UAS','Rata-Rata']
df = pd.DataFrame(data, index, kolom)
df

       Nama  Tugas  UTS  UAS  Rata-Rata
0     Berti     90   85   95       90.5
1  Qorygore     80   85   90       86.6
2      Bimo     70   75   80       78.5

In [4]:
# DataFrame menggunakan dictionary dengan tipe data campuran
import pandas as pd
nama = ['Berti','Qorygore','Bimo']
tugas = [90,80,70]
uts = [85,85,75]
uas = [95,90,80]
ratarata = [90.5,86.6,78.5]
df2 = pd.DataFrame({'Nama':nama, 'Tugas':tugas, 'UTS':uts, 'UAS':uas, 'Rata-Rata':ratarata})
df2

       Nama  Tugas  UTS  UAS  Rata-Rata
0     Berti     90   85   95       90.5
1  Qorygore     80   85   90       86.6
2      Bimo     70   75   80       78.5